cf/DataProcessors/ПроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПроведениеПоПартиям</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/ПрогрессБар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрогрессБар</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/ПроведениеПоПартиям/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПровестиНаСервере(ОтключитьИтоги)
	
	Поток.ЗапуститьПоток("ПартионныйУчет.РассчитатьПартии('"+Формат(Период.ДатаНачала,"ДФ=yyyyMMdd")+"','"+Формат(Период.ДатаОкончания,"ДФ=yyyyMMdd")+"',"""+ИмяФормы+""",Параметры.ОтключитьИтоги)",УникальныйИдентификатор,Новый Структура("ОтключитьИтоги",ОтключитьИтоги));
	
КонецПроцедуры


&НаКлиенте
Процедура Провести(Команда)
	
	ПодключитьОбработчикОжидания("ПоказатьТекущееСостояние",1);
	ПровестиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиБезОтключенияИтогов(Команда)
	
	ПодключитьОбработчикОжидания("ПоказатьТекущееСостояние",1);
	ПровестиНаСервере(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьТекущееСостояние()
	СтруктураВозврата = ПоказатьТекущееСостояниеНаСервере(ИмяФормы);
	Прогресс=СтруктураВозврата.Прогресс;
	Сост=СтруктураВозврата.Состояние;
	Состояние(Сост,Прогресс);
	Если Лев(Сост,9)="Выполнено" Тогда
		ОтключитьОбработчикОжидания("ПоказатьТекущееСостояние");
		СброситьСчетчик(ИмяФормы);
		Сообщить(сост);
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьТекущееСостояниеНаСервере(ИмяФормы)
	Возврат РегистрыСведений.ПрогрессБар.ПолучитьЗначение(ИмяФормы);
КонецФункции

&НаСервереБезКонтекста
Процедура СброситьСчетчик(ИмяФормы)
	 РегистрыСведений.ПрогрессБар.СброситьСчетчик(ИмяФормы);
КонецПроцедуры


&НаСервере
Процедура ПересчитатьИтогиНаСервере()
	// Вставить содержимое обработчика.
	РегистрыНакопления.ПартииТоваров.ПересчитатьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьИтоги(Команда)
	ПересчитатьИтогиНаСервере();
КонецПроцедуры
